<p><a href="http://www.catb.org/hacker-emblem/" target="_blank"><img style="padding-right: 5px; margin: 0px" src="http://media.nata2.org/images/glider.png" align="left"></a>Este es el sitio de <a href="http://nata2.org/">Dar&iacute;o Vasconcelos</a>. Soy un programador ("desarrollador" suena m&aacute;s elegante pero a la vez no suena a nada) con una verdadera pasi&oacute;n por los asuntos de la Vida, el Universo y Todo lo dem&aacute;s. Conozco <a href="http://en.wikipedia.org/wiki/Phrases_from_The_Hitchhiker%27s_Guide_to_the_Galaxy#Answer_to_the_Ultimate_Question_of_Life.2C_the_Universe.2C_and_Everything_.2842.29">la respuesta</a>, pero la pregunta sigue escap&aacute;ndoseme de las manos (<i>Es-ca-p&aacute;n-do-se-me</i>. Helo ah&iacute;. No m&aacute;s palabras de seis s&iacute;labas en este sitio).</p>
<p>Profesionalmente, trabajo con bits y bytes y todo lo que los produzca. Soy CTO de <a href="http://webxsp.com">WebXSP</a>, una empresa dedicada tanto a lots bits y bytes como a los pixeles. Este blog no est&aacute; directamente relacionado con nada ni nadie, a veces ni siquiera conmigo. Si te interesa contactarme, puedes hacerlo en <a href="mailto:dario.vasconcelos@gmail.com">mi direcci&oacute;n de correo</a>. Si antes quieres averiguar si soy un attention-whore o un amargado de tiempo completo, puedes leer las tonter&iacute;as que se me ocurren <a href="http://twitter.com/dariuus">en Twitter (@dariuus).</a></p>
<p>El blog usa <a href="http://jekyllrb.com">Jekyll</a>, un motor genial para masoquistas y fan&aacute;ticos de la tecnolog&iacute;a que te da control total sobre tantas cosas a la hora de producir tu blog, que es dif&iacute;cil no desarrollar S&iacute;ndrome de Estocolmo despu&eacute;s de usarlo por un tiempo. El layout, colores y estructura inicial fueron copiados sin verg&uuml;enza -pero s&iacute; un poco de culpabilidad y mucho agradecimiento- <a href="http://www.nata2.org/">del blog de Harper Reed</a>. </p>
<p>El simbolito que parece el tablero del juego de mesa m&aacute;s f&aacute;cil del mundo es en realidad un <i>Glider</i>. Si no sabes qu&eacute; es un glider, puedes aprender un poco <a href="http://www.catb.org/hacker-emblem/faqs.html">ac&aacute;</a>.
<script>
var b=window,c=document,f=false;
function _click(d){    var a="status=0,scrollbars=0,menubar=0,statusbar=0,resizable=1, width=300,height=500,location="+(h()?"1":"0");b.open(d,"",a)}
function h(){if(b.ActiveXObject&&b.XMLHttpRequest){return false}return true};
</script>
<p>If you want to contact me <a name="s" target="_blank" href="http://www.google.com/talk/service/badge/Start?tk=z01q6amlqtujnl6pvfokj2one9hmtk497vg29vdfi6q0qfdaj57cn4kval4vg0deih01q0v2sbsveu8d51nvi9faiglrcc8ela57sp9e2urd0m04gc1vn2cdc8ppjt010vl2hok0dqsj1tjn99egtftuo92car714o27bltqt" id="chat-link">click here to start a chat.</a>
<div id="chat-wrapper-main" style="display:none;"></div>
</p>
